In [3]:
! pip install SQLAlchemy==2.0.29

Requirement already satisfied: SQLAlchemy==2.0.29 in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.0.29)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.12/site-packages (from SQLAlchemy==2.0.29) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from SQLAlchemy==2.0.29) (3.3.0)

In [4]:
! pip install mysql-connector-python==8.3.0

Collecting mysql-connector-python==8.3.0
  Downloading mysql_connector_python-8.3.0-cp312-cp312-manylinux_2_17_x86_64.whl.metadata (1.9 kB)
Downloading mysql_connector_python-8.3.0-cp312-cp312-manylinux_2_17_x86_64.whl (21.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.5/21.5 MB 25.7 MB/s  0:00:00m0:00:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

In [5]:
! pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (91 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.3.5-cp312-cp312-manylinux_2_27_x86_64.manylinux_2_28_x86_64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (12.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.4/12.4 MB 18.4 MB/s  0:00:00m0:00:0100:01
Downloading numpy-2.3.5-cp312-cp312-manylinux_2_27_x86_64.manylinux_2_28_x86_64.whl (16.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 16.6/16.6 MB 40.2 MB/s  0:00:006m0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, numpy, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed numpy-2.3.5 pandas-2.3.3 pytz-2025.2

In [6]:
! pip install mysqlclient==2.2.4

Collecting mysqlclient==2.2.4
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp312-cp312-linux_x86_64.whl size=133329 sha256=871e19367f4c41667abf4a7c9ab081861cb90f3828c9fd338cb1008328f79973
  Stored in directory: /home/codespace/.cache/pip/wheels/20/6f/c3/3b23bb01988b1c0bea0668e2116315ce43ced2179724ab593e
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

In [7]:
import pandas as pd
import sqlalchemy as db

In [10]:
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/db_movies_netflix_transact")

conn = engine.connect()

# cargando Datos a dimension Movie

In [8]:
query = """
SELECT 
    movie.movieID as movieID, movie.movieTitle as title, movie.releaseDate as releaseDate, 
    gender.name as gender , person.name as participantName, participant.participantRole as roleparticipant 
FROM movie 
INNER JOIN participant 
ON movie.movieID=participant.movieID
INNER JOIN person
ON person.personID = participant.personID
INNER JOIN movie_gender 
ON movie.movieID = movie_gender.movieID
INNER JOIN gender 
ON movie_gender.genderID = gender.genderID
"""

In [12]:
movies_data = pd.read_sql(query, con=conn)

movies_data["movieID"] = movies_data["movieID"].astype('int')

movies_data

,movieID,title,releaseDate,gender,participantName,roleparticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director

In [19]:
# cargar csv

movies_awards = pd.read_csv("./data/Awards_movie.csv")

movies_awards["movieID"] = movies_awards["movieID"].astype('int')

movies_awards.rename(columns={"Aware": "Award"}, inplace = True)

movies_awards

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [26]:
movie_data_final = pd.merge(movies_data, movies_awards,
                             left_on = "movieID", right_on="movieID")

movie_data_final

,movieID,title,releaseDate,gender,participantName,roleparticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,1,Grammy

In [27]:
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/dw_netflix")

conn_dw =engine.connect()

In [35]:
movie_data_final = movie_data_final.rename(columns={"releaseDate": "releaseMovie", "Award": "awardMovie"})


movie_data_final = movie_data_final.drop(columns=['IdAward'])

In [36]:
movie_data_final

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [37]:
movie_data_final.to_sql('dimMovie', conn_dw, if_exists='append', index= False)

3

# Cargamos Datos a dimUsers

In [39]:
users = pd.read_csv("./data/users.csv", sep='|')

users.head(5)

    idUser     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [42]:
users = users.rename(columns= {"idUser": "userID"})
users.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [59]:
users.to_sql("dimUser", conn_dw, if_exists='append', index= False)

20

# Cargamos Datos a tabla hechos

In [45]:
users_id = users["userID"]

movies_id = movie_data_final["movieID"]

In [48]:
users_id.head()

0    1002331
1    1002332
2    1002333
3    1002334
4    1002335
Name: userID, dtype: int64

In [49]:
movies_id.head()

0    80192187
1    80210920
2    81157374
Name: movieID, dtype: int64

In [52]:
watchs_data=pd.merge(users_id,movies_id, how="cross")

watchs_data.head()

    userID   movieID
0  1002331  80192187
1  1002331  80210920
2  1002331  81157374
3  1002332  80192187
4  1002332  80210920

In [53]:
import random
from datetime import datetime, timedelta
import random

def gen_rating():
    # Generar un número aleatorio entre 0 y 5 con 1 solo decimal
    numero_aleatorio = round(random.uniform(0, 5), 1)
    # Mostrar el número aleatorio
    return numero_aleatorio

def gen_timestamp():
    # Generar un timestamp aleatorio dentro de un rango específico
    start_date = datetime(2024, 1, 15)
    end_date = datetime(2024, 4, 6)

    # Calcular un valor aleatorio entre start_date y end_date
    random_date = start_date + timedelta(seconds=random.randint(0, int((end_date - start_date).total_seconds())))

    # Mostrar el timestamp aleatorio
    return random_date

In [55]:
watchs_data["rating"] = watchs_data["movieID"].apply(lambda x: gen_rating())

watchs_data["timestamp"] = watchs_data["userID"].apply(lambda x: gen_timestamp())

In [56]:
watchs_data.head()

    userID   movieID  rating           timestamp
0  1002331  80192187     2.2 2024-04-04 06:19:48
1  1002331  80210920     3.2 2024-04-02 15:52:42
2  1002331  81157374     3.4 2024-02-05 06:37:23
3  1002332  80192187     2.4 2024-01-28 06:26:46
4  1002332  80210920     4.3 2024-02-19 00:58:31

In [60]:
watchs_data.to_sql("FactWatchs", conn_dw, if_exists='append', index=False)

60